--==============================================================================================
-- 이 파일은 lua 문법에 따라 작성되어야 합니다.
-- 이 파일은 캐릭터 서버에서 SecondPassword 관련 설정을 하는 파일입니다.
-- 무단으로 내용의 수정은 절대 불허합니다.
--
-- Date : 14, Feb, 2011
-- Author : InGeon, Kim (Program Unit/RO1/Gravity)
--==============================================================================================

-- Second Password 관련된 설정 파일입니다.


--//////////////////////////////////////////////////////////////////////////////
-- Second Password를 사용할 지 여부를 나타냅니다. (1:사용, 0:미사용)
--//////////////////////////////////////////////////////////////////////////////

EnableSecondPW = 
{
	UseSecondPW = 1;
}


--//////////////////////////////////////////////////////////////////////////////
-- Second Password 이용안하기 기능을 쓸지 않쓸지 여부를 나타냅니다.
-- (1:사용, 0:미사용)
--//////////////////////////////////////////////////////////////////////////////
UsedSecondPWNotAvail = 
{
	SecondPWNotAvail = 1;
}

--//////////////////////////////////////////////////////////////////////////////
-- Second Password로 사용할 수 없는 금칙어 키워드 리스트를 이 곳에 나열합니다.
-- ex) 설정방법 : "{ [[제한키워드]] }, "
--//////////////////////////////////////////////////////////////////////////////

SecondPWRestrictKeyTbl = 
{
	{ [[0000]] }, 
	{ [[1111]] }, 
	{ [[2222]] }, 
	{ [[3333]] }, 
	{ [[4444]] }, 
	{ [[5555]] }, 
	{ [[6666]] }, 
	{ [[7777]] }, 
	{ [[8888]] }, 
	{ [[9999]] }, 
	{ [[0123]] }, 
	{ [[1234]] }, 
	{ [[2345]] }, 
	{ [[3456]] }, 
	{ [[4567]] }, 
	{ [[5678]] }, 
	{ [[6789]] }, 
	{ [[7890]] }, 
};


--//////////////////////////////////////////////////////////////////////////////
-- Second Password를 사용하지 않는 IP 리스트를 등록합니다.
-- ex) 설정방법 : "{ [[192.168.5.50]] },"
--//////////////////////////////////////////////////////////////////////////////

SecondPWNoCheckIP = 
{
	{ [[59.10.115.39]] },
	{ [[59.10.115.28]] },
	{ [[59.10.115.40]] },
};


function main()	
	--/////////////////////////////////////////////////
	-- 하단의 내용은 절대 수정하지 않아야 합니다.
	--/////////////////////////////////////////////////
	
	result, msg = SetEnableSecondPW( EnableSecondPW.UseSecondPW );
	if( not result ) then 
		return false, msg;
	end
	
	result, msg = SetUsedSecondPWNotAvail( UsedSecondPWNotAvail.SecondPWNotAvail );
	if( not result ) then 
		return false, msg;
	end
	
	for k, v in pairs( SecondPWRestrictKeyTbl ) do
		result, msg = SetRestrictSecondPW( v[1] );
		if( not result ) then
			return false, msg;
		end
	end
		
	for k, v in pairs( SecondPWNoCheckIP ) do
		result, msg = SetSecondPWNoCheckIP( v[1] );
		if( not result ) then
			return false, msg;
		end
	end
	
	return true, "good";
end